{
  "id": "8fb8d2ad-4c10-47bb-a466-db7f2d24ed4f",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Kerehaklu Estate - Peaberries",
  "slug": "kerehaklu-estate-peaberries",
  "description": "<p>This special two-pack(<span data-olk-copy-source=\"MessageBody\">125 gms each)</span>, crafted in partnership with Kerehaklu Estate, features our favourite mutation, a Peaberry. Coffee cherries usually hold two seeds but about 5-10% of the time, just one seed grows inside the cherry. This is a Peaberry. Small, round, and denser than regular coffee beans, it boasts a unique flavour profile, with a deeper sweetness and a brighter acidity. </p>\n<p>Carefully isolated by Pranoy, Ajoy, and team at the farm, the Peaberries that lent to the creation of this pack were processed in two distinct ways: - </p>\n<p><strong>Washed (Aerobic Sequential)</strong>  </p>\n<p>This lot underwent a sequential aerobic fermentation, where Peaberries were submerged in water for an extended period, creating an oxygen-rich environment that brought out complexity, clarity, and bright acidity.  </p>\n<p>Roasted light, these make for a cup with the aroma of brown sugar and citrus, and a juicy mouthfeel that opens into notes of mosambi, toffee, and green grape. The aftertaste is sweet and reminds of ripe mosambis.  </p>\n<p><strong>Natural (Anoxic)</strong> </p>\n<p>Fermented in an oxygen-free environment, the coffee cherries in this lot experienced a slower, more complex fermentation, since the microbes had more time to break down the sugars present, and produce a wider range of aromatic compounds. The result is a rich, fruity flavour profile with a deep body and balance.  </p>\n<p>Roasted light, these make for a cup with the aroma of red grape and dark cherries, and a creamy mouthfeel revealing notes of orange, red grape, and red apple. Punctuating each sip is a lingering aftertaste of red apple.   </p>\n<p>We recommend brewing these coffees black as a Pour Over or using an AeroPress.</p>\n<p><strong>Recommended Resting Period: </strong>15 Days</p>\n<p><strong>Note:</strong><span> This coffee pack is a special release with limited availability and, therefore, cannot be included in our Mixed Bag subscription.</span></p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/02_Kerehaklu-Estate-Peaberry-Natural__Washed_Natural.jpg?v=1739270298",
  "direct_buy_url": "https://bluetokaicoffee.com/products/kerehaklu-estate-peaberries",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:46:44.323774",
  "updated_at": "2025-05-04T23:46:44.323777",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}