{
  "id": "2f6dfce1-4e5f-4826-8181-b01327cdc4c2",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Attikan Estate 250g + Channi",
  "slug": "attikan-estate-250g-channi",
  "description": "<p><strong>Rich Dark Chocolate, Figs, and Roasted Almond Notes:</strong> This medium-dark roast coffee offers a smooth yet bold flavour profile, with dark chocolate, figs, and roasted almonds that give every sip a warm, layered richness. </p>\n<p><strong>Perfect Black or With Milk:</strong> Enjoy the flexibility of this coffee—it’s delicious both as a black coffee or with milk, giving you a chocolatey and nutty cup every time. </p>\n<p><strong>Includes a Stainless Steel Channi:</strong> This combo comes with a stainless steel channi (filter), making it easy to enjoy a smooth cup anytime you want. Perfect for at-home brewing or gifting to a coffee lover. </p>\n<p><strong>Ideal for Manual Brewing and Channi-Friendly:</strong> This versatile coffee shines in a variety of manual brewing methods, from Moka Pot and South Indian Filter to AeroPress. Easily brewed with the included channi, it’s convenient for a quick, indulgent cup at home. </p>\n<p><strong>Description:</strong> Indulge in the nuanced flavours of Attikan Estate coffee, where each sip reveals layers of dark chocolate and fig sweetness with subtle nutty notes of almond. This versatile coffee can be enjoyed black or with milk, and pairs well with manual brewing methods—including a quick, easy channi brew.</p>\n<p> </p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/Attikan-Estate-_-Channi__Front.jpg?v=1732779205",
  "direct_buy_url": "https://bluetokaicoffee.com/products/attikan-estate-250g-channi",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:47:31.970594",
  "updated_at": "2025-05-04T23:47:31.970598",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}