{
  "id": "45a21596-d845-4757-acb4-3baf27666810",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Vienna Roast 250g + Channi",
  "slug": "vienna-roast-250g-channi",
  "description": "<p><strong>Bold Cocoa, Oaky, and Bittersweet Flavours:</strong> This dark roast coffee delivers a rich profile with deep cocoa notes, a hint of oak, and a perfectly balanced bittersweet finish. </p>\n<p><strong>Best Enjoyed with Milk:</strong> Smooth and robust, this coffee is best savoured with milk, making for a creamy, indulgent cup with every brew. </p>\n<p><strong>Includes a Stainless Steel Channi:</strong> Paired with a stainless steel channi (filter), this combo makes it simple to prepare a perfectly filtered cup at home, ideal for coffee enthusiasts and as a thoughtful gift. </p>\n<p><strong>Perfect for Espresso &amp; Manual Brewing—Channi-Friendly Too:</strong> Crafted to be brewed as an espresso or with manual methods like Moka Pot, French Press, or South Indian Filter. Easily prepared with the included channi, it’s convenient to brew a strong, satisfying coffee whenever you need. </p>\n<p><strong>Description:</strong> Savour the bold, bittersweet flavours of our Vienna Roast, where cocoa richness and oaky undertones create an indulgent taste experience. Best enjoyed with milk, this coffee is adaptable for various manual brewing methods, including a quick, smooth channi brew at home.</p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/Vienna-Roast-_-Channi__Front.jpg?v=1732780372",
  "direct_buy_url": "https://bluetokaicoffee.com/products/vienna-roast-250g-channi",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:47:31.939923",
  "updated_at": "2025-05-04T23:47:31.939927",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}