{
  "id": "1997f767-64a2-447c-98c4-be218f65967d",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "MSP Micro Lot Blend",
  "slug": "msp-micro-lot-blend",
  "description": "<p>A melting pot of micro-climates where some of India’s finest coffee has thrived since 1920, MSP Coffee is a group of seven estates in Yercaud, including the three that lend to this blend. </p>\n<p>From achieving a surprisingly sweet cup after fermenting coffee with a local variety of bitter lemons to seeing the tail end of a 1000-hour ferment, the group exemplifies how curiosity lies at the heart of their work. The micro lots we picked for this blend come from Bison Valley Estate, Stanmore Estate, and Orchardale Estate and bear this very spirit. </p>\n<p>The first lot was washed and fermented with melon extract, with the processing imparting a unique sweetness. The second underwent triple fermentation: first as whole cherries, then after depulping, and finally after washing. This process uniquely combined quick dry fermentation and long anaerobic fermentation with watermelon, developing complexity. The third coffee was processed using the natural method, with cherries dried intact, allowing the fruit to shape its character. </p>\n<p>Roasted medium, the blend has a fruity and punchy flavour profile with notes of cherry, dark chocolate, and wild berry, followed by a rich, lingering aftertaste of chocolate. </p>\n<p>This blend works well black as well as with milk and lends itself nicely to most brewing methods including espresso, Pour Over, Moka Pot, French Press, AeroPress, and Cold Brew.</p>\n<p><strong>Recommended Resting Period: </strong>7 Days</p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/1._MSPMicroLotBlend__Front_-01.jpg?v=1740635611",
  "direct_buy_url": "https://bluetokaicoffee.com/products/msp-micro-lot-blend",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:46:47.359572",
  "updated_at": "2025-05-04T23:46:47.359575",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}