{
  "id": "87a46530-608b-4ba6-b7b4-2a1471340e71",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Wine Barrel Aged Coffee",
  "slug": "wine-barrel-aged-coffee",
  "description": "<p>Meet our three-pack of wine barrel aged coffees, beautifully merging the world of fine wine and specialty coffee.  </p>\n<p>Green coffee beans sourced from Baarbara Estate were aged for seven weeks in Fratelli wine barrels that had previously held three of their exceptional wines. The barrels were rotated every 5 days to ensure even infusion, and samples were drawn regularly to track the beans’ flavour development. After ageing, the beans rested for 10-15 days in our warehouses and were then roasted to a medium profile.  </p>\n<p>From this process, three distinct, layered, and comforting coffees have emerged. Named after the wines previously stored in the barrels used during processing, the coffees in this selection are:  </p>\n<ul>\n<li>MS Late Harvest treats you to notes of black cherry, prune, and red wine. </li>\n<li>Sette Collection brews cups with notes of red grape, orange, and walnut. </li>\n<li>J'Noon White tastes of sparkling wine, stone fruits, and raspberry. </li>\n</ul>\n<p>We recommend brewing this selection black.  </p>\n<p><strong>Note:</strong> The wine-like tasting notes in these coffees are a result of their unique processing. All offerings in this pack are non-alcoholic.</p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/WineBarrelAgedCup2.jpg?v=1735020269",
  "direct_buy_url": "https://bluetokaicoffee.com/products/wine-barrel-aged",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:47:14.365788",
  "updated_at": "2025-05-04T23:47:14.365791",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}