{
  "id": "07c80c1d-29b4-48b4-8612-d56e5a87920f",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Riverdale Estate - White Rose",
  "slug": "riverdale-estate-white-rose",
  "description": "<p>Fermented with rose petals, this layered light roast perfectly embodies why Riverdale Estate is a pioneer in experimental processing.  </p>\n<p>Only the ripest cherries, hand-picked from the higher-altitude blocks of the farm, where the fruit matures slowly and develops an enhanced sweetness, were used. Once harvested, the cherries underwent a triple wash with natural spring water to remove impurities, followed by a floating process to eliminate underdeveloped beans.  </p>\n<p>During fermentation, rose petals were introduced, setting up the stage for complexity in the cup. After fermentation, the cherries were slow-dried on raised beds for up to 30 days, allowing for even drying. Finally, the coffee was hulled at the estate’s dry mill, where any defective beans were eliminated before being sent to our roastery.  </p>\n<p>In the cup, you’ll experience bright notes of blood orange, passion fruit, and pomegranate, complemented by a creamy mouthfeel and a lingering sweetness.  </p>\n<p>We recommend brewing it black using an AeroPress or as a Pour Over.</p>\n<p><span data-olk-copy-source=\"MessageBody\"><strong>Note:</strong> This coffee is a special release with limited availability and, therefore, cannot be included in our Mixed Bag subscription.</span></p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/01_RiverdaleEstate-WhiteRose__Front.jpg?v=1737957453",
  "direct_buy_url": "https://bluetokaicoffee.com/products/riverdale-estate-white-rose",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:47:03.622944",
  "updated_at": "2025-05-04T23:47:03.622948",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}