{
  "id": "d931f765-a2ed-423e-ac10-0a3ffc6eca25",
  "roaster_id": "2245177f-5c78-4619-864f-6e85afa00e03",
  "name": "SCA Coffee Skills Program: Sensory Skills (Intermediate)",
  "slug": "sca-coffee-skills-program-sensory-skills-intermediate",
  "description": "<p data-mce-fragment=\"1\"><b data-mce-fragment=\"1\">Sensory Skills (Intermediate)- 10 Points </b></p>\n<p data-mce-fragment=\"1\">In this two-day course, we further examine the use of Specialty Coffee Association's (SCA) Coffee Taster's Flavour Wheel and the World Coffee Research Sensory Lexicon for enhanced sensory recognition. This session includes acid profiling and multiple cupping sessions using the SCA Coffee Taster's Score Sheet to understand the nuances of coffee, followed by lively discussions. Proper protocol for arranging professional cupping sessions is reviewed, integrating SCA / Cup of Excellence (COE) standards.</p>\n<p data-mce-fragment=\"1\"><b data-mce-fragment=\"1\">Duration: </b><span style=\"font-weight: 400;\" data-mce-fragment=\"1\">16 hours (2 days)</span></p>\n<p><b>About:</b></p>\n<p>Conducted by Sherri Johns our coffee mentor, barista trainer and Head Judge of the Gems of Araku competition. Sherri is an Authorised SCA Trainer (AST), former Cup of Excellence Head Judge, globally-recognised coffee expert who conducts certified SCA class offerings ensuring the highest quality of instruction for beginning Barista, Roasters, the serious and curious coffee connoisseur.</p>\n<p><span style=\"font-weight: 400;\">All the courses are hosted at Araku World Specialty Coffee Academy (AWSCA), located at our flagship in Bangalore, Indiranagar. The academy is equipped with top-of-the-line tools and an in-house roastery. ⁠The Coffee Skills Program at AWSCA consists of three different modules: Introduction to Coffee for beginners and coffee-enthusiasts, and specialised courses such as Barista Skills and Sensory Skills in different levels. The courses range from 1-5 days with an opportunity for practical and written online exams to receive SCA certification.</span></p>\n<p data-mce-fragment=\"1\"> </p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0734/5609/1456/files/Araku-SherriJohns-October2021_96of150_1__11zon.jpg?v=1724330156",
  "direct_buy_url": "https://www.arakucoffee.in/products/sca-coffee-skills-program-sensory-skills-intermediate",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-05T00:18:37.407392",
  "updated_at": "2025-05-05T00:18:37.407396",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}