{
  "id": "414dd011-bd00-4a0a-9b6a-c4f239c1497e",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Dhak Blend 250g + Channi",
  "slug": "dhak-blend-250g-channi",
  "description": "<p><strong>Rich Dark Chocolate, Cocoa, and Fruit Jam Notes:</strong> This dark roast offers a bold, layered profile with deep dark chocolate and cocoa flavours, complemented by a hint of fruit jam for a unique, indulgent taste. </p>\n<p><strong>Best Enjoyed with Milk:</strong> Perfectly balanced and smooth with milk, this coffee creates a full-bodied, creamy cup that’s satisfying and rich. </p>\n<p><strong>Includes a Stainless-Steel Channi:</strong> This combo comes with a stainless steel channi (filter), making it easy to brew a smooth, grit-free cup at home—ideal for coffee lovers and as a thoughtful gift option. </p>\n<p><strong>Versatile Brewing Options—Channi-Friendly for Effortless Brewing:</strong> The Dhak Blend is recommended for espresso-based drinks as well as manual methods like Moka Pot and French Press. With the channi, you can also enjoy a well-filtered, bold cup quickly and easily. </p>\n<p><strong>Description:</strong> Indulge in the rich, bold flavours of our Dhak Blend, where dark chocolate, cocoa, and a touch of fruit jam come together to create a memorable coffee experience. Ideal for espresso and manual brews, this dark roast can also be easily prepared with the channi, delivering a smooth, satisfying cup every time. <br></p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/Dhak-Blend-_-Channi__Front.jpg?v=1732781463",
  "direct_buy_url": "https://bluetokaicoffee.com/products/dhak-blend-250g-channi",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:47:20.857154",
  "updated_at": "2025-05-04T23:47:20.857156",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}