{
  "id": "a928996e-0365-4979-b95b-8d9e5577162b",
  "roaster_id": "2245177f-5c78-4619-864f-6e85afa00e03",
  "name": "Coffee Harmony",
  "slug": "coffee-harmony",
  "description": "<p>Discover the perfect harmony of flavour with ARAKU Green Moka Pot and Coffee set. Designed to elevate your coffee moments with rich and aromatic notes.</p>\n<p><span data-sheets-value='{\"1\":2,\"2\":\"Our orange (green/blue/yellow) Moka Pot Gift Box is the perfect gift for the coffee-lovers in your life. The signature ARAKU Moka Pot is a three-part coffee maker that is perfect for easily brewing a hot, highly intense cup. It’s crafted using insulated wood, enamel and food-grade stainless steel, avoiding the harmful effects of the more commonly used aluminium. The chic, tiered ARAKU Moka Pot is inspired by traditional Japanese teapots and makes two cups in four minutes. The gift box includes two ARAKU espresso cups; the stoneware cups have an elegant two-toned design with a white finish and a pop of colour on the inside. The cups are ideal for an espresso shot (50ml). The ARAKU Moka Pot and espresso cup set are exclusively designed for ARAKU by Norwegian design duo Anderssen &amp; Voll. Torbjørn Anderssen and Espen Voll have won several accolades including Wallpaper Award, Red Dot Award and the IF Award, and are renowned for their finesse in blending Scandinavian design sensibilities with various cultural influences, creating objects with a distinct voice. The ARAKU Moka Pot and espresso cup set echo the vibrant colours of the Araku region, and are a joyful addition to any home brewing station! Pick a colour for the ARAKU Moka Pot and espresso set and complete your bespoke gift box by choosing an ARAKU coffee from our range: Signature, Selection, Micro Climate and Grand Reserve. Signature is a coffee for everyone with its bold, exquisite character and, for the discerning palate, there is a resemblance to fine tea. Selection is a strong and full-bodied coffee that is created for espresso connoisseurs looking for a bold coffee experience. Micro Climate is distinctly different with its generous body and wholesome notes of candied fruit almost, with a hint of elegant bitterness in its finish. Grand Reserve is our most treasured offering yet; a highly complex and magnificent coffee defined by its silky, full-bodied mouthfeel.\"}' data-sheets-userformat='{\"2\":513,\"3\":{\"1\":0},\"12\":0}'>The signature ARAKU Moka Pot is a three-part coffee maker that is perfect for easily brewing a hot, highly intense cup. It’s crafted using insulated wood, enamel and food-grade stainless steel, avoiding the harmful effects of the more commonly used aluminium. </span><span> The chic, tiered ARAKU Moka Pot is inspired by traditional Japanese teapots and makes two cups in four minutes.</span></p>\n<p>This gift box includes an ARAKU Green Moka Pot and a Coffee Tin.<br><br><em>﻿You can add your gift note at once you have added the gift box to your cart!</em><br></p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0734/5609/1456/files/1.GreenMokaPotSignatureTin_1.jpg?v=1692622730",
  "direct_buy_url": "https://www.arakucoffee.in/products/coffee-harmony",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-05T00:18:20.702606",
  "updated_at": "2025-05-05T00:18:20.702611",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}