{
  "id": "f23ede59-5c95-40dd-937e-358a2036b2f9",
  "roaster_id": "e1395f47-d411-467d-8f17-449f7f9b6a2c",
  "name": "Riverdale Estate – Gesha Natural",
  "slug": "riverdale-estate-gesha-natural",
  "description": "<p>We’re excited to bring back Nano-X, our series of experiments created by a handful of visionary producers and creative Blue Tokai roasters, with the prized Gesha from Riverdale Estate.  </p>\n<p>The Gesha variety is considered among the most sought-after, most expensive, and highest-scoring coffees which tend to score 90 points and above, in any part of the world. It originally hails from Ethiopia’s Gori Gesha Forest and was responsible for completely changing the world’s coffee landscape.  </p>\n<p>Geshas are very hard to come across, and since last year, Prakashan and his team have been among the few ensuring a homegrown Gesha flourishes at Riverdale Estate. The coffee cherries he and his team harvested this year were processed by performing carbonic maceration in barrels, an experimental processing technique in which ripe coffee cherries are fermented in a CO2-rich, anaerobic environment.</p>\n<p>Roasted light, the result is an exceptional lot, with the pleasant aroma of jasmine and oranges, and a multitude of delicate floral and fruity notes that evolve as the brew cools. </p>\n<p><strong>Tasting Notes:</strong> <span data-contrast=\"auto\" lang=\"EN\" class=\"TextRun SCXW266734271 BCX0\"><span class=\"NormalTextRun SCXW266734271 BCX0\">Cantaloupe, Pomegranate, Bergamot, Jasmine</span></span></p>\n<p><strong>Roast Level:</strong><span> </span>Light</p>\n<p><strong>About the Farm and Producer </strong></p>\n<p>Nestled in the Shevaroy Hills of Tamil Nadu, Riverdale Estate has been managed by three generations since 1920. Its producer, Prakashan Balaraman, is one of the front-runners for experimental processing in India and he believes that the secret to good coffee begins with the crop. He’s been challenging traditional growing and processing practices and has previously processed coffees for us where interesting elements like papaya, pineapple and champagne yeast were used.</p>\n<p><strong>About the Roaster</strong> </p>\n<p>Our roasting team was very excited to work with a Gesha for the 2nd year, and one of our seasoned roasters, Shreyas, fine-tuned its roast profile. He appreciates how it makes for a clean, complex cup with a bouquet of delicate fruity notes, with floral notes standing out. </p>\n<p><strong>Please Note:</strong> This is a special release available in limited quantities. Due to the exclusive nature of this coffee, no replacements or refunds will be offered. Every batch has been carefully cupped and approved by our expert roasters to ensure the highest quality. We recommend enjoying this coffee between 20 and 30 days post-roast, ideally after two weeks, for the best flavor experience.</p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0738/1409/files/Nano_Gesha_01.jpg?v=1734402068",
  "direct_buy_url": "https://bluetokaicoffee.com/products/riverdale-estate-gesha-natural",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-04T23:47:40.186814",
  "updated_at": "2025-05-04T23:47:40.186817",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}