{
  "id": "82aed62c-33d9-4a20-814b-901fae832238",
  "roaster_id": "2245177f-5c78-4619-864f-6e85afa00e03",
  "name": "SCA Coffee Skills Program: Sensory Skills (Foundation)",
  "slug": "sca-coffee-skills-program-sensory-skills-foundation",
  "description": "<p data-mce-fragment=\"1\"><b data-mce-fragment=\"1\">Sensory Skills (Foundation) - 05 Points</b></p>\n<p data-mce-fragment=\"1\"><span style=\"font-weight: 400;\" data-mce-fragment=\"1\">In this one-day course you will learn the fundamentals of sensory evaluation of roasted coffee, an essential skill for many positions across the food and beverage industry. The Authorised Specialty Coffee Association Trainer (AST) will take you through: how the human body perceives taste and flavour, how to communicate a sensory experience methodically, introduction to the SCA Coffee Taster's Flavour Wheel and the World Coffee Research Sensory Lexicon. This course includes multiple tastings and one cupping session with instructions for what cupping is and why we cup.<br><b data-mce-fragment=\"1\"></b></span></p>\n<p data-mce-fragment=\"1\"><span style=\"font-weight: 400;\" data-mce-fragment=\"1\"><b data-mce-fragment=\"1\">Duration: </b>8 hours (1 day)<br></span></p>\n<p data-mce-fragment=\"1\"><span><strong>About:</strong> </span></p>\n<p data-mce-fragment=\"1\"><span>Conducted by Sherri Johns our coffee mentor, barista trainer and Head Judge of the Gems of Araku competition. Sherri is an Authorised SCA Trainer (AST), former Cup of Excellence Head Judge, globally-recognised coffee expert who conducts certified SCA class offerings ensuring the highest quality of instruction for beginning Barista, Roasters, the serious and curious coffee connoisseur. </span></p>\n<p data-mce-fragment=\"1\">All the courses are hosted at Araku World Specialty Coffee Academy (AWSCA), located at our flagship in Bangalore, Indiranagar. The academy is equipped with top-of-the-line tools and an in-house roastery. ⁠The Coffee Skills Program at AWSCA consists of three different modules: Introduction to Coffee for beginners and coffee-enthusiasts, and specialised courses such as Barista Skills and Sensory Skills in different levels. The courses range from 1-5 days with an opportunity for practical and written online exams to receive SCA certification.</p>\n<p data-mce-fragment=\"1\"><span style=\"font-weight: 400;\" data-mce-fragment=\"1\"><br></span></p>",
  "roast_level": "unknown",
  "bean_type": "unknown",
  "processing_method": "unknown",
  "image_url": "https://cdn.shopify.com/s/files/1/0734/5609/1456/files/v29wg2gj39h0zzqnxxej_1.jpg?v=1724330122",
  "direct_buy_url": "https://www.arakucoffee.in/products/sca-coffee-skills-program-sensory-skills",
  "region_id": null,
  "is_seasonal": false,
  "is_available": true,
  "is_featured": false,
  "is_single_origin": true,
  "tags": [],
  "deepseek_enriched": false,
  "created_at": "2025-05-05T00:18:39.359484",
  "updated_at": "2025-05-05T00:18:39.359487",
  "region_name": null,
  "flavor_profiles": [],
  "brew_methods": [],
  "external_links": {},
  "prices": {}
}